Sandgreenpanda/2026-ESP32/src/main.cpp
    Serial.println("loop begin");
    while (1) {

        // Read the ssh data and send it to the websocket clients
        if (!hp_1_session.conn || hp_1_session.read() < 1) { // Returns rbytes, checks for no-bytes-transferred/error
            // If the connection is down, dont read by short circuit evaluation
            vTaskDelay(1 / portTICK_PERIOD_MS);
        }

        if (ssh_command != "" && hp_1_session.conn) {
            // Write the websocket data to ssh
            hp_1_session.write(ssh_command);
            ssh_command = ""; // Reset command to prevent infinite loop

        } else if (hp_1_status_req) {
            String cmd_output = hp_1_session.exec_cmd("echo alive");
            cmd_output.trim();
            hp_1_session.conn = (cmd_output == "alive");
            Serial.println(cmd_output);
            if (!hp_1_session.conn) {
                Serial.println("HP1 Disconnect! Reconnecting...");
                // TODO: Reconnect logic for turn on

                // hp_1_session.connect();
                hp_1_session.brutal_exception();
                if (hp_1_session.connect() != NULL) {
                    hp_1_session.conn = true;
                } else {
                    hp_1_session.conn = false;
                }
            }
            hp_1_status_req = false;
        } else {
            if (millis() - lastHandleKeepAlive >= 10000 && hp_1_session.conn) { // Every 10 seconds
                Serial.println("Keep Alive Check");
                hp_1_session.keep_alive();
                lastHandleKeepAlive = millis();
            }
        }
    }
    hp_1_session.conn = true;
    hp_1_session.disconnect();

    return 0;
}

void controlTask(void *pvParameter) {
    wifiMulti.run();
    Serial.println("Wifi run finished");
    wait_for_wifi_exec(ex_main);
}

void serverTask(void *params) {
    // Server task in different thread on same core for async behavior.
    Serial.println("Creating a new self-signed certificate.");
    Serial.println("This may take up to a minute, so be patient ;-)");

    cert = new SSLCert();

    esp_task_wdt_delete(NULL);

    int createCertResult = createSelfSignedCert(
        *cert,
        KEYSIZE_2048,
        "CN=10.47.6.92,O=Sandgreenpanda,C=DE",
        "20190101000000",
        "20300101000000");

    esp_task_wdt_add(NULL);

    // Now check if creating that worked
    if (createCertResult != 0) {
        Serial.printf("Cerating certificate failed. Error Code = 0x%02X, check SSLCert.hpp for details", createCertResult);
        while (true)
            delay(500);
    }
    Serial.println("Creating the certificate was successful");

    secureServer = new HTTPSServer(cert, 443, MAX_CLIENTS);

    ResourceNode *nodeRoot = new ResourceNode("/", "GET", &handleRoot);
    ResourceNode *node404 = new ResourceNode("", "GET", &handle404);
    ResourceNode *nodeTerminal = new ResourceNode("/terminal", "GET", &handleTerminal);
    ResourceNode *nodeTerminalPost = new ResourceNode("/terminal_post", "POST", &handleTerminalPost);
    ResourceNode *nodeToggle1 = new ResourceNode("/toggle1", "POST", &handleToggle1);
    ResourceNode *nodeToggle2 = new ResourceNode("/toggle2", "POST", &handleToggle2);
    ResourceNode *nodeToggle3 = new ResourceNode("/toggle3", "POST", &handleToggle3);
    ResourceNode *nodeToggle4 = new ResourceNode("/toggle4", "POST", &handleToggle4);
    ResourceNode *nodeToggle5 = new ResourceNode("/toggle5", "POST", &handleToggle5);
    ResourceNode *nodeToggle6 = new ResourceNode("/toggle6", "POST", &handleToggle6);
    ResourceNode *nodeAdmin = new ResourceNode("/admin", "GET", &handleAdmin);
    ResourceNode *nodeLogIn = new ResourceNode("/admin", "POST", &handleLogIn);

    ResourceNode *nodeHandleFan = new ResourceNode("/fan", "POST", &handleFan);
    ResourceNode *nodeHandleStyle = new ResourceNode("/style.css", "GET", &handleStyle);
    ResourceNode *nodeHandleComputers = new ResourceNode("/computers", "GET", &handleComputers);

    ResourceNode *nodeHandleTerminalUpdate = new ResourceNode("/update", "GET", &handleTerminalUpdate);
    ResourceNode *nodehandleSSHpage = new ResourceNode("/sshpage", "GET", &handleSSHpage);
    WebsocketNode *sshNode = new WebsocketNode("/ssh", &SSHHandler::create);
    ResourceNode *nodeSSHStatus1 = new ResourceNode("/SSH1Status", "POST", &handleSSHStatus1);

    // Adding the node to the server works in the same way as for all other nodes
    secureServer->registerNode(sshNode);
    secureServer->registerNode(nodehandleSSHpage);

    // Add the root node to the server
    secureServer->registerNode(nodeRoot);
    // Add the 404 not found node to the server.
    secureServer->setDefaultNode(node404);
    // Add Terminal node
    secureServer->registerNode(nodeTerminal);
    secureServer->registerNode(nodeTerminalPost);
    secureServer->registerNode(nodeSSHStatus1);
    secureServer->registerNode(nodeToggle1);
    secureServer->registerNode(nodeToggle2);
    secureServer->registerNode(nodeToggle3);
    secureServer->registerNode(nodeToggle4);
    secureServer->registerNode(nodeToggle5);
    secureServer->registerNode(nodeToggle6);
    secureServer->registerNode(nodeHandleFan);
    secureServer->registerNode(nodeHandleComputers);

    secureServer->registerNode(nodeAdmin);
    secureServer->registerNode(nodeLogIn);

    secureServer->registerNode(nodeHandleStyle);

    secureServer->registerNode(nodeHandleTerminalUpdate);

    secureServer->addMiddleware(&middlewareAuth);

    Serial.println("Starting server...");
    secureServer->start();
    if (secureServer->isRunning()) {
        Serial.println("Server ready.");

        // "loop()" function of the separate task
        while (true) {
            // This call will let the server do its work
            secureServer->loop();

            // Other code would go here...
            delay(1);
        }
    }
}

void setup() {

    digitalWrite(LAPTOP_HP_1, LOW);
    digitalWrite(LAPTOP_HP_2, LOW);
    digitalWrite(LAPTOP_HP_3, LOW);
    digitalWrite(LAPTOP_LENOVO_1, LOW);
    digitalWrite(LAPTOP_ACER_1, LOW);
    digitalWrite(LAPTOP_ACER_2, LOW);
    pinMode(LAPTOP_HP_1, OUTPUT);
    pinMode(LAPTOP_HP_2, OUTPUT);
    pinMode(LAPTOP_HP_3, OUTPUT);
    pinMode(LAPTOP_LENOVO_1, OUTPUT);
    pinMode(LAPTOP_ACER_1, OUTPUT);
    pinMode(LAPTOP_ACER_2, OUTPUT);

